app/Controllers/Auth.php

SELECT *
FROM `tbl_user`
WHERE `username` = 'admin'
---
    public function cekLoginUser()
    {
        if ($this->validate(
            [
                'username' => [
                    'label' => 'Username',
                    'rules' => 'required',
                    'errors' => [
                        'required' => '{field} Tidak Boleh Kosong !!'
                    ]
                ],
                'password' => [
                    'label' => 'Password',
                    'rules' => 'required',
                    'errors' => [
                        'required' => '{field} Tidak Boleh Kosong !!'
                    ]
                ],
            ]
        )) {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            $cek =  $this->db->table('tbl_user')->where(['username' => $username,])->get()->getRowArray();

UPDATE `tbl_user` SET `salah_password` = 0
WHERE `username` = 'admin'
---
                        if (password_verify($password, $cek['password'])) {
                            session()->set('id_user', $cek['id_user']);
                            session()->set('level', 1);
                            $this->db->table('tbl_user')->set('salah_password', '0', false)->where('username', $cek['username'])->update();