app/Models/ModelLokasi.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_lokasi`
---
    function count_all()
    {

        $db = $this->db->table('tbl_lokasi');
        return $db->countAllResults();