app/Models/ModelKaryawan.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_karyawan`
WHERE `status_karyawan` = '1'
---
    function count_all_aktif()
    {
        $db = $this->db->table('tbl_karyawan');
        $db->where('status_karyawan', "1");
        return $db->countAllResults();